import './assets/main.css';
import { createApp } from 'vue';
import App from './App.vue';
import router from './router';

// --------------------------------------------------
// Vueアプリケーションを生成
// App.vue を「アプリの本体」として登録
// --------------------------------------------------
const app = createApp(App);

// --------------------------------------------------
// ルーターをアプリに組み込む
// <router-view> が使用可能
// --------------------------------------------------
app.use(router);

// --------------------------------------------------
// Vueアプリを HTML の #app に描画する
// --------------------------------------------------
app.mount('#app');
